/**
 * These names test various resolution and normalization behaviors.
 *
 * @see https://adraffy.github.io/ens-normalize.js/test/resolver.html
 */
export const RAFFY_NAMES = [
	"nIcK.eTh",
	"brantly.cash",
	"🏴‍☠.art",
	"..a..eth",
	"öbb",
	"Öbb",
	"◌̈bb",

	// Punycode
	"xn--ls8h",
	"xn--💩",
	"💷pound",

	// Wrapper
	"firstwrappedname",
	"please.pumpdeezbags.eth",
	"dessert3.menu.bestsushi7.eth",
	"david",

	// Subdomain
	// "nowzad.loopring.eth", // https://github.com/namehash/ensnode/issues/1482
	"239.chonksociety.eth",
	"raffy.antistupid.com",

	// Wildcard
	"moo331.nft-owner.eth",
	"💎.gmcafe.eth",
	// "1.offchainexample.eth", // https://github.com/namehash/ensnode/issues/1482
	// "barmstrong.cb.id", // takes a really long time and is super flaky?

	// Offchain DNS
	// "brantly.rocks", // takes a really long time

	// Address
	"0xd8dA6BF26964aF9D7eEd9e03E53415D37aA96045",

	// Contract
	"eth-usd.data.eth",

	// Mapped
	"hyph\u{002D}\u{2010}\u{2011}\u{2012}\u{2013}\u{2014}\u{2015}\u{2043}\u{2212}\u{23AF}\u{23E4}\u{FE58}e\u{2E3A}n\u{2E3B}s",
	"A.™️.Ю",
	"Ⅷ",
	"⨌",

	// Ignored
	"\u{FE0E}\u{FE0F}",

	// Deviation
	"ß",
	"ẞ",
	"ς",

	// Complex
	"_1\u{FE0F}E\u{FE0E}\u{303}\u{AD}\u{1F4A9}\u{24C2}\u{FE0E}\u{2E3B}a\u{301}",

	// Combining Marks
	"\u{300}",
	"💩\u{300}",
	"x\u{300}\u{300}",
	"\u{622}\u{64D}\u{64E}.\u{929}\u{901}\u{902}",
	"AÁẲẬǞÀĂẴẦȦẢẮǍẨǠȂẶÂẪẠĀẰẤÄȀĄ",

	// NSM
	"\u{625}\u{610}\u{610}",
	"\u{625}\u{610}\u{611}\u{612}\u{613}\u{614}",

	// CheckHyphen
	"-test.test-.t-e--s---t",
	"te--st",

	// Underscore
	"__ab",
	"a_b",

	// Emoji
	"©",
	"🕵",
	"🧙‍♂",
	"🏋🏿‍♂",
	"💩💩💩",
	"🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞",
	"👁🗨👁️‍🗨️",
	"🧟🧟♂🧟‍♂",
	"😵‍💫😵‍💫😵‍💫",
	"😵💫😵💫😵💫",
	"👩‍⚕👩🏽‍⚕️",
	"👪👨‍👩‍👦",
	"🚴️🚵️🚴🏻🚴🏼🚴🏽🚴🏾🚴🏿🚵🏻🚵🏼🚵🏽🚵🏾🚵🏿🚴‍♀️🚴‍♂️🚵‍♀️🚵‍♂️🚴🏻‍♀️🚴🏻‍♂️🚴🏼‍♀️🚴🏼‍♂️🚴🏽‍♀️🚴🏽‍♂️🚴🏾‍♀️🚴🏾‍♂️🚴🏿‍♀️🚴🏿‍♂️🚵🏻‍♀️🚵🏻‍♂️🚵🏼‍♀️🚵🏼‍♂️🚵🏽‍♀️🚵🏽‍♂️🚵🏾‍♀️🚵🏾‍♂️🚵🏿‍♀️🚵🏿‍♂️",
	"🦰🦱🦲🦳",
	"👨‍👩‍👦🏿",
	"\u{1F3FB}\u{1F3FC}\u{1F3FD}\u{1F3FE}\u{1F3FF}",
	"💩\u{200D}💩",
	"\u{261D}\u{FE0F}\u{1F3FB}",
	"‼️",
	"⁉️",
	"™ℹⓂ㊗㊙🈁🈂🈚🈯🈲🈳🈴🈵🈶🈷🈸🈹🈺🉐🉑",

	// Non-RGI
	"🐱‍🐉",
	"👪🏻",
	"🤼🏻‍♀️",
	"\u{1F469}\u{1F3FE}\u{200D}\u{1F91D}\u{200D}\u{1F469}\u{1F3FE}",

	// Regional
	"🇦",
	"🇦🇦",
	"🇺🇸🇺🇲",

	// Flag
	"🏴",
	"🏁️",
	"🏳️‍🌈",

	// Tag
	"\u{1F3F4}\u{E0067}\u{E0062}\u{E0065}\u{E006E}\u{E0067}\u{E007F}",
	"\u{1F3F4}\u{E0067}\u{E0062}\u{E0073}\u{E0063}\u{E0074}\u{E007F}",
	"\u{1F3F4}\u{E0067}\u{E0062}\u{E0077}\u{E006C}\u{E0073}\u{E007F}",
	"\u{1F3F4}\u{E0075}\u{E0073}\u{E0063}\u{E0061}\u{E007F}",

	// Circled/Squared
	"i\u{2139}\u{2139}\u{FE0F}🛈",
	"ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ",
	"ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ",
	"⓪①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟",
	"🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉",
	"🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩",
	"⓿❶❷❸❹❺❻❼❽❾❿⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴",
	"🄌➊➋➌➍➎➏➐➑➒➓",
	"㉈㉉㉊㉋㉌㉍㉎㉏",

	// ContextJ - ZWNJ
	"ന്\u{200C}മ",
	"نیم‌فاصله",
	"a\u{200C}b",

	// ContextJ - ZWJ
	"eth\u{200D}\u{200D}\u{200D}.eth",
	"ണ്‍",
	"a\u{200D}b",

	// ContextO
	"\u{6C}\u{B7}\u{6C}",
	"月・水",
	"a・a\u{300}",
	"\u{375}α",
	"\u{5D1}\u{5F3}",

	// CheckBidi
	"פעילותהבינאום",
	"\u{0786}\u{07AE}\u{0782}\u{07B0}\u{0795}\u{07A9}\u{0793}\u{07A6}\u{0783}\u{07AA}",
	"\u{05D9}\u{05B4}\u{05D5}\u{05D0}\u{05B8}",
	"\u{1F1F8}\u{1F1E6}\u{633}\u{644}\u{645}\u{627}\u{646}",
	"\u{633}\u{644}\u{645}\u{627}\u{646}\u{1F1F8}\u{1F1E6}",
	"bahrain.مصر",
	"bahrainمصر",
	"\u{202e}elgoog\u{202d}.eth",
	"\u{202e}hte.elgoog",

	// Keycaps
	"1⃣2️⃣🔟.eth",
	"0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟*️⃣#️⃣",

	// Confusables
	"aα.ɑ",
	"ஶ்ரீ.ஸ்ரீ",
	"i.i\u{307}.\u{131}\u{307}",
	"\u{E8}.e\u{300}.\u{450}.\u{435}\u{300}",

	// Mixed-Script
	"0a〇.黑a8",
	"あアいイうウえエおオ",
	"bitcoin.bitcοin.bi̇tcoin.bitсoin",
	"ァ힣",

	// Whole-Script
	"0x.0χ.0х",
	"apple.дррӏе.аррӏе.aррӏе",
	"ιοσρβυνγ",
	"o.٥.०.౦.੦.൦.ο.օ",
	"あー.〇一.一ー.一.ー.ᅳ",

	// Unicode 15.1
	"≠.≮.≯",

	// Unicode 16.0
	"\u{1CC4A}\u{1CC6D}\u{1CC96}",

	// Unicode 17.0
	"\u{1CEC0}\u{1CEC1}\u{1CEC2}\u{1CEC3}\u{1CEC4}\u{1CEC5}\u{1CEC6}\u{1CEC7}\u{1CEC8}\u{1CEC9}\u{1CECA}\u{1CECB}\u{1CECC}\u{1CECD}\u{1CECE}\u{1CECF}\u{1CED0}",

	// Fenced
	"O'Brian",
	"¼½¾⅐⅑⅒⅓⅔⅕⅖⅗⅘⅙⅚⅛⅜⅝⅞⅟↉",
	"123⁄456's",
	"a'.'z.a''b.a⁄'.⁄a",

	// Misc
	"$¢£¤¥₡₦₩₪₫€₭₮₱₲₴₵₸₹₺₼₽₾⃀₿Ξ.؋",
	"•-•¬.⌐◨-◨.⌐〇-〇¬",
	"360°",
	"2πr.4πθ.8п",
	"Ξ.≡.☰",
	"♢⟠⧫",
	"_▁▂▃▄▅▆▇█",
	"✓.✔︎.✔️.✅️.☑️",
	"ᴀʙᴄᴅᴇꜰɢʜɪᴊᴋʟᴍɴᴏᴘꞯʀꜱᴛᴜᴠᴡxʏᴢ",
	"zʎxʍʌnʇsɹbdouɯꞁʞſ̣ᴉɥᵷɟǝpↄqɐ",
	"💩ąçęşìíîïǐł",

	// Pure Arabic
	"إنترنت",
	"\u{660}\u{661}\u{662}\u{663}\u{664}\u{665}\u{666}\u{667}\u{668}\u{669}.\u{6F0}\u{6F1}\u{6F2}\u{6F3}\u{6F4}\u{6F5}\u{6F6}\u{6F7}\u{6F8}\u{6F9}.\u{6F0}\u{780}",

	// Pure Hebrew
	"שירות־שמות",

	// Restricted
	"𓀀𓀁𓀂",
	"𐌱𐌻𐍉𐌼𐌰",
	"𓆏➡🐸️",
	"a𓀂",
	"ᏎᏮᏂᎥ.eth",

	// Different Norm
	"‑888",
	"۰۱۲۳۷۸۹",

	// Verifications
	"evanmoyer.eth",
];
